Revit 2027 API
ParameterTypeId.ExtrusionAutoParams Property
 "Auto ends"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ExtrusionAutoParams { get; }
Public Shared ReadOnly Property ExtrusionAutoParams As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ExtrusionAutoParams {
	ForgeTypeId^ get ();
}
static member ExtrusionAutoParams : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace